package linear_progs;
//7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

public class Lin7 {
    public static void task(int b) {
        int S = 2*b*b;
        System.out.println(S);
    }
}
